/*ex-pointer array*/ 
#include<stdio.h>

int main() {
    int m[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
    int (*p)[4] = m;  //指向数组类型数据的指针 
    int *(mp[3])     //(指向数组的)指针的数组 
        = {m[0],m[1],m[2]};
    int **pp = mp;   //(指向)指针(数组)的指针 
    //用m,p,mp,pp的数组下标法访问 7,例如： 
    printf("m[1][2]=%d\n",m[1][2]);  
    //用m,p,mp,pp的指针运算法访问 7,例如：
    printf("*(*(pp+1)+2)=%d\n",*(*(pp+1)+2)); 
    //用m,p,mp,pp的行用指针运算法访问 7, 例如：
    printf("*(pp[1]+2)=%d\n",*(pp[1]+2)); 
    //用m,p,mp,pp的列用指针运算法访问 7, 例如： 
    printf("(*(m+1))[2]=%d\n",(*(m+1))[2]);
    //请写出访问元素 1 的几种方法 
    //。。。 
    return 0;
}
